
import numpy as np


def lsa_by_svd(X, k):
    """利用矩阵奇异值分解的潜在语义分析

    :param X: 单词文本矩阵
    :param x: 目标话题数量
    :return: 话题向量空间, 文本集合在话题向量空间的表示
    """
    """
     X（11 个单词，9 篇文档，即矩阵大小为 11 × 9），并设话题组数 k = 3
     U (左奇异矩阵)：大小为 (11, 11)。它表示**“单词 - 潜在话题”**的关联关系。
    S (奇异值一维数组)：大小为 (9,)。它里面按从大到小的顺序存着各个潜在话题的**“权重 / 重要程度”**。
    V (右奇异矩阵)（严格来说是 <span>V^T</span>）：大小为 (9, 9)。它表示**“潜在话题 - 文档”**的关联关系。
        
    """
    U, S, V = np.linalg.svd(X)  # 奇异值分解
    U = U[:, :k]
    S = np.diag(S[:k])
    # 保留矩阵 V 的前 3 行，所有列
    V = V[:k, :]

    return U, np.dot(S, V)


if __name__ == "__main__":
    X = [[0, 0, 1, 1, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 1, 0, 0, 1],
         [0, 1, 0, 0, 0, 0, 0, 1, 0],
         [0, 0, 0, 0, 0, 0, 1, 0, 1],
         [1, 0, 0, 0, 0, 1, 0, 0, 0],
         [1, 1, 1, 1, 1, 1, 1, 1, 1],
         [1, 0, 1, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 1, 0, 1],
         [0, 0, 0, 0, 0, 2, 0, 0, 1],
         [1, 0, 1, 0, 0, 0, 0, 1, 0],
         [0, 0, 0, 1, 1, 0, 0, 0, 0]]

    np.set_printoptions(precision=2, suppress=True)
    U, SV = lsa_by_svd(X, 3)

    print(U)
    # [[-0.15  0.27 -0.04]
    #  [-0.24 -0.38  0.09]
    #  [-0.13  0.17 -0.07]
    #  [-0.18 -0.19 -0.45]
    #  [-0.22 -0.09  0.46]
    #  [-0.74  0.21 -0.21]
    #  [-0.18  0.3   0.28]
    #  [-0.18 -0.19 -0.45]
    #  [-0.36 -0.59  0.34]
    #  [-0.25  0.42  0.28]
    #  [-0.12  0.14 -0.23]]

    """
    它的第一列 [-1.38, 0.84, 0.82] 竖着看，就代表着第 1 篇文档被浓缩成的话题向量。
    以后再去计算两篇文档的相似度时，直接计算它们对应的这 3 维话题向量的余弦相似度就可以了，
    大大降低了计算量，且由于 SVD 的特性，还挖掘出了单词间的潜在同义关系。
    """
    print(SV)
    # [[-1.38 -0.87 -1.32 -1.02 -0.86 -1.92 -1.11 -1.12 -1.71]
    #  [ 0.84  0.39  1.19  0.62  0.35 -1.43 -0.18  0.8  -1.14]
    #  [ 0.82 -0.28  0.31 -0.49 -0.45  1.02 -1.1   0.   -0.67]]