"""
前向算法 (从左往右):              后向算法 (从右往左):

t=1    t=2    t=3    t=4         t=1    t=2    t=3    t=4
 →→→   →→→   →→→   终止         初始化   ←←←   ←←←   ←←←
α₁    α₂    α₃    P(O)         β₄=1    β₃    β₂    P(O)

α_t(i) = [Σα(i→j)] · b(o_t)    β_t(i) = Σ a(i→j) · b(o_{t+1}) · β(j)
                                      ↑ 从后面往前看


最后一步之后没有观测了，概率为 1
时刻:    t=1      t=2      t=3
观测:    o₁=0     o₂=1     o₃=0

β₃(1) = 1,  β₃(2) = 1,  β₃(3) = 1   ← 初始化



sequence[k] 是当前时刻的观测，而 dp[j] 是下一时刻的后向变量。
k=2
sequence[2] = 0  (观测值)

对 i=0:
  dp[0] = a[0][0]*dp[0]*b[0][0] + a[0][1]*dp[1]*b[1][0] + a[0][2]*dp[2]*b[2][0]
        = 0.5*1*0.5 + 0.2*1*0.4 + 0.3*1*0.7
        = 0.250 + 0.080 + 0.210
        = 0.540

对 i=1:
  dp[1] = a[1][0]*1*0.5 + a[1][1]*1*0.4 + a[1][2]*1*0.7
        = 0.3*0.5 + 0.5*0.4 + 0.2*0.7
        = 0.150 + 0.200 + 0.140
        = 0.490

对 i=2:
  dp[2] = 0.2*0.5 + 0.3*0.4 + 0.5*0.7
        = 0.100 + 0.120 + 0.350
        = 0.570

β₂ = [0.540, 0.490, 0.570]
k = 1
sequence[1] = 1  (观测值)

对 i=0:
  dp[0] = a[0][0]*0.540*b[0][1] + a[0][1]*0.490*b[1][1] + a[0][2]*0.570*b[2][1]
        = 0.5*0.540*0.5 + 0.2*0.490*0.6 + 0.3*0.570*0.3
        = 0.135 + 0.0588 + 0.0513
        = 0.2451

β₁ = [0.2451, ... , ...]

end:
P = π₁·b₁(0)·β₁(1) + π₂·b₂(0)·β₁(2) + π₃·b₃(0)·β₁(3)
  = 0.2*0.5*0.2451 + 0.4*0.4*β₁[2] + 0.4*0.7*β₁[3]
  = 0.02451 + ... + ...
  = 0.130218  ← 与前向算法结果一致！


"""




def backward_algorithm(a, b, p, sequence):
    n_state = len(a)
    dp = [1] * n_state

    for k in range(len(sequence) - 1, 0, -1):
        dp = [sum(a[i][j] * dp[j] * b[j][sequence[k]] for j in range(n_state)) for i in range(n_state)]

    return sum(p[i] * b[i][sequence[0]] * dp[i] for i in range(n_state))



if __name__ == "__main__":
    A = [[0.5, 0.2, 0.3],
         [0.3, 0.5, 0.2],
         [0.2, 0.3, 0.5]]
    B = [[0.5, 0.5],
         [0.4, 0.6],
         [0.7, 0.3]]
    p = [0.2, 0.4, 0.4]
    print(backward_algorithm(A, B, p, [0, 1, 0]))  # 0.130218